; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	thermograph3 - mode
	infrared1 - mode
	spectrograph0 - mode
	image4 - mode
	thermograph2 - mode
	Star3 - direction
	Star1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph2)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star3)
	(supports instrument4 image4)
	(supports instrument4 thermograph3)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph2)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image4)
	(supports instrument7 thermograph3)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument8 image4)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 image4)
	(supports instrument9 infrared1)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 spectrograph0)
	(supports instrument10 thermograph3)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument11 thermograph2)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 spectrograph0)
	(calibration_target instrument12 GroundStation4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star14)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite1 GroundStation0)
	(have_image Star5 infrared1)
	(have_image Phenomenon6 thermograph2)
	(have_image Planet7 image4)
	(have_image Planet8 image4)
	(have_image Phenomenon9 thermograph3)
	(have_image Planet10 spectrograph0)
	(have_image Phenomenon11 infrared1)
	(have_image Phenomenon12 infrared1)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 thermograph2)
))

)

; plan
1. (turn_to satellite2 groundstation4 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 groundstation4)
   goals met: 0 of 12
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 12
3. (calibrate satellite2 instrument6 groundstation4)
   added: (calibrated instrument6)
   goals met: 0 of 12
4. (turn_to satellite2 planet10 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet10)
   goals met: 0 of 12
5. (take_image satellite2 planet10 instrument6 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 12
7. (take_image satellite2 phenomenon6 instrument6 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon13 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 12
9. (take_image satellite2 phenomenon13 instrument6 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 3 of 12
10. (turn_to satellite2 phenomenon12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon12)
   goals met: 3 of 12
11. (take_image satellite2 phenomenon12 instrument6 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 4 of 12
12. (turn_to satellite2 phenomenon11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon11)
   goals met: 4 of 12
13. (take_image satellite2 phenomenon11 instrument6 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 5 of 12
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 12
15. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 5 of 12
16. (turn_to satellite0 phenomenon9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 12
17. (take_image satellite0 phenomenon9 instrument0 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 6 of 12
18. (turn_to satellite0 planet7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet7)
   goals met: 6 of 12
19. (take_image satellite0 planet7 instrument0 image4)
   added: (have_image planet7 image4)
   goals met: 7 of 12
20. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 8 of 12
21. (take_image satellite0 planet8 instrument0 image4)
   added: (have_image planet8 image4)
   goals met: 9 of 12
22. (turn_to satellite1 groundstation0 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 groundstation0)
   goals met: 10 of 12
23. (turn_to satellite2 star14 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star14)
   goals met: 10 of 12
24. (take_image satellite2 star14 instrument6 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 11 of 12
25. (turn_to satellite2 star5 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star5)
   goals met: 11 of 12
26. (take_image satellite2 star5 instrument6 infrared1)
   added: (have_image star5 infrared1)
   goals met: 12 of 12
